function dYdt = control4(t, Y, P)
    % t  - текущий момент времени
    % Y - начальные значения переменных
    % P - параметры системы
    psi1 = Y(2)-P(8);
    dfy2=(P(3)+(P(12).^-1))/(P(4)*Y(3));
    dfy3=((P(8)-Y(2)*(P(3)*P(12)-1)))/(P(4)*P(12)*Y(3)*Y(3));

    psi2 = Y(1)-(((P(12)*psi1+(P(3)*(Y(2)+Y(3)))))/(P(4)*Y(3)));
    
    psi1 = Y(2)-P(8);%
    u1= P(2)*Y(1)-P(1)*Y(2)*Y(3)+...
        (dfy2)*...
        (P(3)*(Y(2)+Y(3))-P(4)*Y(1)*Y(3))+...
        (dfy3)*...
        (P(5)*Y(2)-P(6)*Y(3))-...
        (psi2/P(11));
    
    dy1 = P(1)*Y(2)*Y(3)-P(2)*Y(1)+u1;
    dy2 = P(3)*(Y(2)+Y(3))-P(4)*Y(1)*Y(3);
    dy3 = P(5)*Y(2)-P(6)*Y(3);
   

    dYdt=[dy1;dy2;dy3;psi1;u1];
end